[Killed] BlockStatement
src/converter.js:2:1
 function forceConverter(measurement, val)
-{
-    var result1, result2;
-
-    if(measurement == "newton")
-    {
-        result1 = (val*100000).toFixed(2) + " dyne";
-        result2 = (val/4.44822).toFixed(2) + " pound";
-    } else if(measurement === "dyne") {
-        result1 = (val/100000).toFixed(2) + " newton";
-        result2 = (val/444822).toFixed(2) + " pound"; 
-    } else if(measurement === "pound") {
-        result1 = (val*4.44822).toFixed(2) + " newton";
-        result2 = (val*444822).toFixed(2) + " dyne";
-    } else {
-        return "wrong input";
-    }
-    return [result1, result2];
-}
+{}
 
 module.exports = {
killedBy: forceConverter should convert newton to dyne and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["3200000.00 dyne", "7.19 pound"]
Received: undefined

[Killed] ConditionalExpression
src/converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "newton")
+    if(true)
     {
         result1 = (val*100000).toFixed(2) + " dyne";
killedBy: forceConverter should convert dyne to newton and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "32.00 newton",
-   "7.19 pound",

[Killed] ConditionalExpression
src/converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "newton")
+    if(false)
     {
         result1 = (val*100000).toFixed(2) + " dyne";
killedBy: forceConverter should convert newton to dyne and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["3200000.00 dyne", "7.19 pound"]
Received: "wrong input"

[Killed] BlockStatement
src/converter.js:6:5
     var result1, result2;
 
     if(measurement == "newton")
-    {
-        result1 = (val*100000).toFixed(2) + " dyne";
-        result2 = (val/4.44822).toFixed(2) + " pound";
-    } else if(measurement === "dyne") {
+    {} else if(measurement === "dyne") {
         result1 = (val/100000).toFixed(2) + " newton";
         result2 = (val/444822).toFixed(2) + " pound"; 
killedBy: forceConverter should convert newton to dyne and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "3200000.00 dyne",
-   "7.19 pound",

[Killed] ArithmeticOperator
src/converter.js:7:20
 
     if(measurement == "newton")
     {
-        result1 = (val*100000).toFixed(2) + " dyne";
+        result1 = (val / 100000).toFixed(2) + " dyne";
         result2 = (val/4.44822).toFixed(2) + " pound";
     } else if(measurement === "dyne") {
killedBy: forceConverter should convert newton to dyne and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "3200000.00 dyne",
+   "0.00 dyne",

[Killed] StringLiteral
src/converter.js:7:45
 
     if(measurement == "newton")
     {
-        result1 = (val*100000).toFixed(2) + " dyne";
+        result1 = (val*100000).toFixed(2) + "";
         result2 = (val/4.44822).toFixed(2) + " pound";
     } else if(measurement === "dyne") {
killedBy: forceConverter should convert newton to dyne and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "3200000.00 dyne",
+   "3200000.00",

[Killed] ArithmeticOperator
src/converter.js:8:20
     if(measurement == "newton")
     {
         result1 = (val*100000).toFixed(2) + " dyne";
-        result2 = (val/4.44822).toFixed(2) + " pound";
+        result2 = (val * 4.44822).toFixed(2) + " pound";
     } else if(measurement === "dyne") {
         result1 = (val/100000).toFixed(2) + " newton";
killedBy: forceConverter should convert newton to dyne and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "3200000.00 dyne",
-   "7.19 pound",

[Killed] BlockStatement
src/converter.js:9:39
     {
         result1 = (val*100000).toFixed(2) + " dyne";
         result2 = (val/4.44822).toFixed(2) + " pound";
-    } else if(measurement === "dyne") {
-        result1 = (val/100000).toFixed(2) + " newton";
-        result2 = (val/444822).toFixed(2) + " pound"; 
-    } else if(measurement === "pound") {
+    } else if(measurement === "dyne") {} else if(measurement === "pound") {
         result1 = (val*4.44822).toFixed(2) + " newton";
         result2 = (val*444822).toFixed(2) + " dyne";
killedBy: forceConverter should convert dyne to newton and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "32.00 newton",
-   "7.19 pound",

[Killed] EqualityOperator
src/converter.js:9:15
     {
         result1 = (val*100000).toFixed(2) + " dyne";
         result2 = (val/4.44822).toFixed(2) + " pound";
-    } else if(measurement === "dyne") {
+    } else if(measurement !== "dyne") {
         result1 = (val/100000).toFixed(2) + " newton";
         result2 = (val/444822).toFixed(2) + " pound"; 
killedBy: forceConverter should convert dyne to newton and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["32.00 newton", "7.19 pound"]
Received: "wrong input"

[Killed] ArithmeticOperator
src/converter.js:10:20
         result1 = (val*100000).toFixed(2) + " dyne";
         result2 = (val/4.44822).toFixed(2) + " pound";
     } else if(measurement === "dyne") {
-        result1 = (val/100000).toFixed(2) + " newton";
+        result1 = (val * 100000).toFixed(2) + " newton";
         result2 = (val/444822).toFixed(2) + " pound"; 
     } else if(measurement === "pound") {
killedBy: forceConverter should convert dyne to newton and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "32.00 newton",
+   "320000000000.00 newton",

[Killed] ArithmeticOperator
src/converter.js:11:20
         result2 = (val/4.44822).toFixed(2) + " pound";
     } else if(measurement === "dyne") {
         result1 = (val/100000).toFixed(2) + " newton";
-        result2 = (val/444822).toFixed(2) + " pound"; 
+        result2 = (val * 444822).toFixed(2) + " pound"; 
     } else if(measurement === "pound") {
         result1 = (val*4.44822).toFixed(2) + " newton";
killedBy: forceConverter should convert dyne to newton and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "32.00 newton",
-   "7.19 pound",

[Killed] StringLiteral
src/converter.js:11:45
         result2 = (val/4.44822).toFixed(2) + " pound";
     } else if(measurement === "dyne") {
         result1 = (val/100000).toFixed(2) + " newton";
-        result2 = (val/444822).toFixed(2) + " pound"; 
+        result2 = (val/444822).toFixed(2) + ""; 
     } else if(measurement === "pound") {
         result1 = (val*4.44822).toFixed(2) + " newton";
killedBy: forceConverter should convert dyne to newton and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "32.00 newton",
-   "7.19 pound",

[Killed] ConditionalExpression
src/converter.js:12:15
     } else if(measurement === "dyne") {
         result1 = (val/100000).toFixed(2) + " newton";
         result2 = (val/444822).toFixed(2) + " pound"; 
-    } else if(measurement === "pound") {
+    } else if(true) {
         result1 = (val*4.44822).toFixed(2) + " newton";
         result2 = (val*444822).toFixed(2) + " dyne";
killedBy: forceConverter should return "wrong input" for invalid measurement
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: ["44.48 newton", "4448220.00 dyne"]

[Killed] BlockStatement
src/converter.js:12:40
     } else if(measurement === "dyne") {
         result1 = (val/100000).toFixed(2) + " newton";
         result2 = (val/444822).toFixed(2) + " pound"; 
-    } else if(measurement === "pound") {
-        result1 = (val*4.44822).toFixed(2) + " newton";
-        result2 = (val*444822).toFixed(2) + " dyne";
-    } else {
+    } else if(measurement === "pound") {} else {
         return "wrong input";
     }
killedBy: forceConverter should convert pound to newton and dyne
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "32.07 newton",
-   "3207166.62 dyne",

[Killed] ArithmeticOperator
src/converter.js:13:20
         result1 = (val/100000).toFixed(2) + " newton";
         result2 = (val/444822).toFixed(2) + " pound"; 
     } else if(measurement === "pound") {
-        result1 = (val*4.44822).toFixed(2) + " newton";
+        result1 = (val / 4.44822).toFixed(2) + " newton";
         result2 = (val*444822).toFixed(2) + " dyne";
     } else {
killedBy: forceConverter should convert pound to newton and dyne
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "32.07 newton",
+   "1.62 newton",

[Killed] ArithmeticOperator
src/converter.js:14:20
         result2 = (val/444822).toFixed(2) + " pound"; 
     } else if(measurement === "pound") {
         result1 = (val*4.44822).toFixed(2) + " newton";
-        result2 = (val*444822).toFixed(2) + " dyne";
+        result2 = (val / 444822).toFixed(2) + " dyne";
     } else {
         return "wrong input";
killedBy: forceConverter should convert pound to newton and dyne
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "32.07 newton",
-   "3207166.62 dyne",

[Killed] BlockStatement
src/converter.js:15:12
     } else if(measurement === "pound") {
         result1 = (val*4.44822).toFixed(2) + " newton";
         result2 = (val*444822).toFixed(2) + " dyne";
-    } else {
-        return "wrong input";
-    }
+    } else {}
     return [result1, result2];
 }
killedBy: forceConverter should return "wrong input" for invalid measurement
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: [undefined, undefined]

[Killed] StringLiteral
src/converter.js:16:16
         result1 = (val*4.44822).toFixed(2) + " newton";
         result2 = (val*444822).toFixed(2) + " dyne";
     } else {
-        return "wrong input";
+        return "";
     }
     return [result1, result2];
killedBy: forceConverter should return "wrong input" for invalid measurement
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: ""

[Killed] ArrayDeclaration
src/converter.js:18:12
     } else {
         return "wrong input";
     }
-    return [result1, result2];
+    return [];
 }
 
killedBy: forceConverter should convert newton to dyne and pound
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "3200000.00 dyne",
-   "7.19 pound",
