[Killed] BlockStatement
src/isPalindromeS.js:1:29
-function isPalindrome(name) {
-    name = name.toString();
-    let len = name.length;
-    for(let i=0; i<len/2; i++) {
-        if(name[i] != name[len-i-1]) return false;
-    }
-    return true;
-}
+function isPalindrome(name) {}
 // console.log(isPalindrome(''))
 module.exports = {
killedBy: isPalindrome should return true for an empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/isPalindromeS.js:4:32
 function isPalindrome(name) {
     name = name.toString();
     let len = name.length;
-    for(let i=0; i<len/2; i++) {
-        if(name[i] != name[len-i-1]) return false;
-    }
+    for(let i=0; i<len/2; i++) {}
     return true;
 }
killedBy: isPalindrome should return false for a non-palindrome string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/isPalindromeS.js:4:18
 function isPalindrome(name) {
     name = name.toString();
     let len = name.length;
-    for(let i=0; i<len/2; i++) {
+    for(let i=0; false; i++) {
         if(name[i] != name[len-i-1]) return false;
     }
killedBy: isPalindrome should return false for a non-palindrome string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/isPalindromeS.js:5:12
     name = name.toString();
     let len = name.length;
     for(let i=0; i<len/2; i++) {
-        if(name[i] != name[len-i-1]) return false;
+        if(name[i] == name[len - i - 1]) return false;
     }
     return true;
killedBy: isPalindrome should return true for a single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/isPalindromeS.js:5:28
     name = name.toString();
     let len = name.length;
     for(let i=0; i<len/2; i++) {
-        if(name[i] != name[len-i-1]) return false;
+        if(name[i] != name[len + i-1]) return false;
     }
     return true;
killedBy: isPalindrome should return true for a palindrome string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
