[Killed] BlockStatement
src/quickSort.js:1:25
-function quickSort(arr) {
-    if (arr.length <= 1) {
-      return arr;
-    }
-  
-    let pivot = arr[0];
-    let leftArr = [];
-    let rightArr = [];
-  
-    for (let i = 1; i < arr.length; i++) {
-      if (arr[i] < pivot) {
-        leftArr.push(arr[i]);
-      } else {
-        rightArr.push(arr[i]);
-      }
-    }
-  
-    return [...quickSort(leftArr), pivot, ...quickSort(rightArr)];
-}
+function quickSort(arr) {}
 // console.log(quickSort([3, 7, 2, 5, 1]));
 
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 5, 7]
Received: undefined

[Killed] ConditionalExpression
src/quickSort.js:2:9
 function quickSort(arr) {
-    if (arr.length <= 1) {
+    if (true) {
       return arr;
     }
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Timeout] EqualityOperator
src/quickSort.js:2:9
 function quickSort(arr) {
-    if (arr.length <= 1) {
+    if (arr.length > 1) {
       return arr;
     }

[Killed] ArrayDeclaration
src/quickSort.js:7:19
     }
   
     let pivot = arr[0];
-    let leftArr = [];
+    let leftArr = ["Stryker was here"];
     let rightArr = [];
   
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 6

  Array [
+   "Stryker was here",
+   "Stryker was here",

[Timeout] ArrayDeclaration
src/quickSort.js:8:20
   
     let pivot = arr[0];
     let leftArr = [];
-    let rightArr = [];
+    let rightArr = ["Stryker was here"];
   
     for (let i = 1; i < arr.length; i++) {

[Killed] ConditionalExpression
src/quickSort.js:10:21
     let leftArr = [];
     let rightArr = [];
   
-    for (let i = 1; i < arr.length; i++) {
+    for (let i = 1; false; i++) {
       if (arr[i] < pivot) {
         leftArr.push(arr[i]);
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/quickSort.js:10:42
     let leftArr = [];
     let rightArr = [];
   
-    for (let i = 1; i < arr.length; i++) {
-      if (arr[i] < pivot) {
-        leftArr.push(arr[i]);
-      } else {
-        rightArr.push(arr[i]);
-      }
-    }
+    for (let i = 1; i < arr.length; i++) {}
   
     return [...quickSort(leftArr), pivot, ...quickSort(rightArr)];
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

  Array [
-   1,
-   2,

[Killed] EqualityOperator
src/quickSort.js:11:11
     let rightArr = [];
   
     for (let i = 1; i < arr.length; i++) {
-      if (arr[i] < pivot) {
+      if (arr[i] >= pivot) {
         leftArr.push(arr[i]);
       } else {
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/quickSort.js:11:11
     let rightArr = [];
   
     for (let i = 1; i < arr.length; i++) {
-      if (arr[i] < pivot) {
+      if (true) {
         leftArr.push(arr[i]);
       } else {
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    1,
-   2,

[Killed] BlockStatement
src/quickSort.js:13:14
     for (let i = 1; i < arr.length; i++) {
       if (arr[i] < pivot) {
         leftArr.push(arr[i]);
-      } else {
-        rightArr.push(arr[i]);
-      }
+      } else {}
     }
   
killedBy: quickSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    1,
    2,
